flask/results/get-text/1.txt
This is ApacheBench, Version 2.3 <$Revision: 1901567 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient).....done


Server Software:        gunicorn
Server Hostname:        0.0.0.0
Server Port:            3000

Document Path:          /text
Document Length:        11 bytes

Concurrency Level:      10
Time taken for tests:   0.072 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      16400 bytes
HTML transferred:       1100 bytes
Requests per second:    1392.23 [#/sec] (mean)
Time per request:       7.183 [ms] (mean)
Time per request:       0.718 [ms] (mean, across all concurrent requests)
Transfer rate:          222.97 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     2    7   2.2      6      11
Waiting:        1    6   2.1      6      10
Total:          2    7   2.2      6      11

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      7
  75%      8
  80%     10
  90%     10
  95%     11
  98%     11
  99%     11
 100%     11 (longest request)